trimmedFlatPlate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//scale 0.333333333333333;

vertices
(
    (0.1 0 0)     //0
    (0.1 0 -0.01)   //1
    (2 0 0)     //2
    (2 0 -0.01)   //3
    (2 0.4 0)   //4
    (2 0.4 -0.01) //5
    (0.1 0.2 0)   //6
    (0.1 0.2 -0.01)   //7
);

blocks
(
    hex (0 2 3 1 6 4 5 7) (250 1 300) simpleGrading (20 1 4000)
);

edges
(
);


boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 7 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 5 4 2)
        );
    }
    cut
    {
        type wall;
        faces
        (   
            (4 5 7 6)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (0 1 3 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 4 6)
            (1 7 5 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //




