trimmedFlatPlate/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.08e-3; // 1.08e-3 = 1.125*(69.4)^2/5e6 // 11=3.9% 18.1=5%;

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        setAverage      off;
        offset          0;
    }

    outlet
    {
        type            zeroGradient;
    }

    cut
    {
        type            timeVaryingMappedFixedValue;
        setAverage      off;
        offset          0;
    }

    wall
    {
        //type            kqRWallFunction;
        //value           $internalField;
        type            fixedValue;
        value           1e-10;
    }
  
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
