trimmedFlatPlate/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-16;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      1;
        nPostSweeps     1;
        nFinestSweeps   1;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 16;
        mergeLevels     1;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-16;
        relTol          0.01;
    }

    k
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-16;
        relTol          0;
    }
    
    omega
    {
       solver           PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-16;
        relTol          0;
    }
    
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;


    residualControl
    {
        p               1e-10;
        U               1e-10;
        "(k|epsilon|omega)" 1e-10;
    }


    consistent          yes;
}

relaxationFactors
{
    equations
    {
        U               0.7;
        p               0.7;
        k               0.7;
        omega           0.7;
    }
}


cache
{
    grad(U);
}

// ************************************************************************* //
